Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Some time ago, we started experimenting on how to improve the efficiency of JSON serialization and deserialization offered by Jackson and extensively used in Quarkus applications. From a performance point of view, Jackson's main bottleneck is its heavy reliance on Java reflection to access or populate data objects at runtime. To address this issue, we developed a build-time metaprogramming approach that generates reflection-free serializers and deserializers for Jackson.
ja_jp: 以前から、Jackson が提供し、Quarkus アプリケーションで広く使用されている JSON のシリアル化とデシリアル化の効率を改善する方法を試してきました。パフォーマンスの観点から見ると、Jackson の主なボトルネックは、実行時にデータオブジェクトにアクセスしたり、データを入力したりするために Java のリフレクションに大きく依存していることです。この問題に対処するため、Jackson 向けにリフレクションなしのシリアライザーとデシリアライザーを生成するビルド時メタプログラミング アプローチを開発しました。

source: Some types of extensions
ja_jp: エクステンションのタイプ

source: Some use cases will require custom configuration of OpenTelemetry. These sections will outline what is necessary to properly configure it.
ja_jp: 一部のユースケースでは、OpenTelemetry のカスタム設定が必要になります。 これらのセクションでは、適切に設定するために必要なものについて概説します。

source: Some vendor-specific protocols need a custom ID Generator, you can override the default one by creating a producer. The OpenTelemetry extension will detect the `IdGenerator` CDI bean and will use it when configuring the tracer producer.
ja_jp: ベンダー固有のプロトコルの中には、カスタム ID ジェネレーターを必要とするものがありますが、 プロデューサーを作成することで、デフォルトの ID ジェネレーターを上書きすることができます。OpenTelemetry エクステンションは、 `IdGenerator` CDI Bean を検出し、トレーサープロデューサーを設定する際にそれを使用します。

source: Some well known providers such as GitHub or LinkedIn are not OpenID Connect but OAuth2 providers which support the `authorization code flow`, for example, link:https://docs.github.com/en/developers/apps/building-oauth-apps/authorizing-oauth-apps[GitHub OAuth2] and link:https://docs.microsoft.com/en-us/linkedin/shared/authentication/authorization-code-flow[LinkedIn OAuth2].
ja_jp: GitHub や LinkedIn といった有名なプロバイダーのいくつかは、 OpenID Connect ではなく、OAuth2 `authorization code flow` をサポートするプロバイダーです。例えば、link:https://docs.github.com/en/developers/apps/building-oauth-apps/authorizing-oauth-apps[GitHub OAuth2]や link:https://docs.microsoft.com/en-us/linkedin/shared/authentication/authorization-code-flow[LinkedIn OAuth2] などです。

source: Some well known providers such as `GitHub` or `LinkedIn` are not `OpenID Connect` but `OAuth2` providers which support the `authorization code flow`, for example, link:https://docs.github.com/en/developers/apps/building-oauth-apps/authorizing-oauth-apps[GitHub OAuth2] and link:https://docs.microsoft.com/en-us/linkedin/shared/authentication/authorization-code-flow[LinkedIn OAuth2].
ja_jp: `GitHub` や `LinkedIn` などの有名なプロバイダは、 `OpenID Connect` ではなく、 `authorization code flow` をサポートする `OAuth2` プロバイダです。例えば、 link:https://docs.github.com/en/developers/apps/building-oauth-apps/authorizing-oauth-apps[GitHub OAuth2] や link:https://docs.microsoft.com/en-us/linkedin/shared/authentication/authorization-code-flow[LinkedIn OAuth2] などです。

source: Some well known providers such as `GitHub` or `LinkedIn` are not `OpenId Connect` but `OAuth2` providers which support the `authorization code flow`, for example, link:https://docs.github.com/en/developers/apps/building-oauth-apps/authorizing-oauth-apps[GitHub OAuth2] and link:https://docs.microsoft.com/en-us/linkedin/shared/authentication/authorization-code-flow[LinkedIn OAuth2].
ja_jp: `GitHub` や `LinkedIn` といった有名なプロバイダーのいくつかは、 `OpenId Connect` ではなく、 `OAuth2` `authorization code flow` をサポートするプロバイダーです。例えば、 link:https://docs.github.com/en/developers/apps/building-oauth-apps/authorizing-oauth-apps[GitHub OAuth2]や link:https://docs.microsoft.com/en-us/linkedin/shared/authentication/authorization-code-flow[LinkedIn OAuth2] などです。

source: Some well-known providers such as GitHub or LinkedIn are not OpenID Connect providers, but OAuth2 providers that support the `authorization code flow`. For example, link:https://docs.github.com/en/developers/apps/building-oauth-apps/authorizing-oauth-apps[GitHub OAuth2] and link:https://docs.microsoft.com/en-us/linkedin/shared/authentication/authorization-code-flow[LinkedIn OAuth2]. Remember, OIDC is built on top of OAuth2.
ja_jp: GitHubやLinkedInのような有名なプロバイダはOpenID Connectプロバイダではなく、 `authorization code flow` をサポートするOAuth2プロバイダです。 例えば、 link:https://docs.github.com/en/developers/apps/building-oauth-apps/authorizing-oauth-apps[GitHub OAuth2] や link:https://docs.microsoft.com/en-us/linkedin/shared/authentication/authorization-code-flow[LinkedIn OAuth2] などです。 OIDCはOAuth2の上に構築されていることを思い出してください。

source: Some well-known providers, such as GitHub or LinkedIn, are not OpenID Connect providers, but OAuth2 providers that support the `authorization code flow`. For example, link:https://docs.github.com/en/developers/apps/building-oauth-apps/authorizing-oauth-apps[GitHub OAuth2] and link:https://docs.microsoft.com/en-us/linkedin/shared/authentication/authorization-code-flow[LinkedIn OAuth2]. Remember, OIDC is built on top of OAuth2.
ja_jp: GitHub や LinkedIn のような有名なプロバイダーは OpenID Connect プロバイダーではなく、 `authorization code flow` をサポートする OAuth2 プロバイダーです。 たとえば、link:https://docs.github.com/en/developers/apps/building-oauth-apps/authorizing-oauth-apps[GitHub OAuth2] や link:https://docs.microsoft.com/en-us/linkedin/shared/authentication/authorization-code-flow[LinkedIn OAuth2] などです。 OIDC は OAuth2 の上に構築されていることを思い出してください。

source: Something had to be done. Luckily, my colleague Eric Deandrea had been working on this exact problem for several years. Eric had a benchmark, based on an earlier one from John O'Hara, and he'd built up a set of automations which allowed measurements to be run in our performance lab, under controlled conditions.
ja_jp: 何かをする必要がありました。幸いなことに、私の同僚であるEric Deandreaは、この正確な問題に数年間取り組んでいました。Ericは、以前John O'Haraが作成したベンチマークに基づいて、制御された条件下でパフォーマンスラボで測定を実行できる一連の自動化を構築していました。

source: Something in my classpath has @Inject annotations, which are confusing CDI. How can I fix that?
ja_jp: クラスパスのいずれかに @Inject アノテーションが追加されており、CDI が正しく機能しません。修正する方法を教えてください

source: Something missing? Open an issue on https://github.com/smallrye/smallrye-reactive-utils/issues[SmallRye Reactive Utils].
ja_jp: 何か足りないものがあった場合は、 https://github.com/smallrye/smallrye-reactive-utils/issues[SmallRye Reactive Utils] に課題を提起してください。

source: Sometimes ID tokens are forwarded to the application frontends as bearer tokens as well for the endpoints be aware about the user who is currently logged into SPA or to perform an out-of-band token verification. Choose `Test with ID Token` option in such cases.
ja_jp: エンドポイントがSPAに現在ログインしているユーザーを認識するため、または帯域外のトークン検証を実行するために、IDトークンがベアラートークンとしてアプリケーションフロントエンドに転送されることがあります。このような場合は、 `Test with ID Token` オプションを選択してください。

source: Sometimes a value isn't necessary for the build to complete, but might inform some behavior of the build step if it is present. In this case, the value can be optionally injected.
ja_jp: ビルドを完了するために値が必要ない場合もありますが、値が存在する場合は、ビルドステップの動作を通知する場合があります。この場合、値はオプションで挿入できます。

source: Sometimes extensions need to extend the set of built-in CDI contexts.
ja_jp: 時々、エクステンションは組み込みCDI コンテキストのセットを拡張する必要があります。

source: Sometimes extensions need to inspect the beans, observers and injection points, then perform additional validations and fail the build if something is wrong.
ja_jp: エクステンションは、Bean、オブザーバー、およびインジェクションポイントを検査し、さらに追加の検証を実行して、何か問題がある場合はビルドを失敗にする必要があります。

source: Sometimes it is desirable to select the destination of a message dynamically. In this case, you should not configure the address inside your application configuration file, but instead, use the outbound metadata to set the address.
ja_jp: メッセージの宛先を動的に選択することが望ましい場合があります。この場合、アプリケーション設定ファイル内でアドレスを設定するのではなく、アウトバウンドメタデータを使用してアドレスを設定する必要があります。

source: Sometimes it is practical to be able to register a _synthetic bean_. Bean attributes of a synthetic bean are not derived from a Java class, method or field. Instead, all the attributes are defined by an extension. In regular CDI, this could be achieved using the https://jakarta.ee/specifications/cdi/2.0/cdi-spec-2.0.html#after_bean_discovery[`AfterBeanDiscovery.addBean()`, window="_blank"] methods.
ja_jp: ときには、_合成 Bean_ を登録できると便利な場合もあります。合成 Bean の Bean 属性は、Java クラス、メソッド、またはフィールドから派生したものではありません。代わりに、すべての属性はエクステンションによって定義されます。そうするために、通常の CDI では https://jakarta.ee/specifications/cdi/2.0/cdi-spec-2.0.html#after_bean_discovery[`AfterBeanDiscovery.addBean()`, window="_blank"] メソッドを使用できます。

source: Sometimes it is practical to be able to register a _synthetic bean_. Bean attributes of a synthetic bean are not derived from a Java class, method or field. Instead, all the attributes are defined by an extension. In regular CDI, this could be achieved using the https://jakarta.ee/specifications/cdi/4.1/jakarta-cdi-spec-4.1.html#after_bean_discovery[`AfterBeanDiscovery.addBean()`, window="_blank"] and https://jakarta.ee/specifications/cdi/4.1/jakarta-cdi-spec-4.1.html#bce_synthesis[`SyntheticComponents.addBean()`] methods.
ja_jp: 場合によっては、_合成 Bean_ を登録できると便利です。 合成 Bean の Bean 属性は、Java クラス、メソッド、またはフィールドから導出されたものではありません。 すべての属性はエクステンションによって定義されます。 通常の CDI では、 https://jakarta.ee/specifications/cdi/4.1/jakarta-cdi-spec-4.1.html#after_bean_discovery[`AfterBeanDiscovery.addBean()`, window="_blank"] メソッドと https://jakarta.ee/specifications/cdi/4.1/jakarta-cdi-spec-4.1.html#bce_synthesis[`SyntheticComponents.addBean()`] メソッドを使用してこれを実現できます。

source: Sometimes it is very useful to be able to register a synthetic bean. Bean attributes of a synthetic bean are not derived from a java class, method or field. Instead, the attributes are specified by an extension.
ja_jp: 合成 Beanを登録できると非常に便利なことがあります。合成 Beanのビーン属性は，javaクラス，メソッド，フィールドから派生したものではありません。その代わりに、属性はエクステンションによって指定されます。

source: Sometimes it may be necessary to access public methods and properties of a CDI bean that is not annotated with `@Named`. However, if you don't control the source of the bean it is not possible to add the `@Named` annotation. Nevertheless, it is possible to create an intermediate CDI bean annotated with `@Named`. This intermediate bean can inject the bean in question and make it accessible. A Java record is a very convenient way to define such an intermediate CDI bean.
ja_jp: 場合によっては、`@Named` アノテーションが付けられていない CDI Bean のパブリックメソッドとプロパティーにアクセスする必要がある場合があります。 ただし、Bean のソースを制御していない場合は、`@Named` アノテーションを追加できません。 ただし、`@Named` アノテーションが付けられた中間 CDI Bean を作成することは可能です。 この中間 Bean は、問題の Bean を注入してアクセス可能にできます。 Java レコードは、このような中間 CDI Bean を定義するのに非常に便利な方法です。

source: Sometimes it might be useful to register an existing annotation that is not annotated with `@jakarta.inject.Qualifier` as a CDI qualifier. This is similar to what CDI achieves through `BeforeBeanDiscovery#addQualifier()`. We are going to use `QualifierRegistrarBuildItem` to get it done.
ja_jp: 場合によっては、 `@jakarta.inject.Qualifier` でアノテーションされていない既存のアノテーションを CDI 修飾子として登録しておくと便利です。 これは CDI が `BeforeBeanDiscovery#addQualifier()` を通して実現していることに似ています。 ここでは `QualifierRegistrarBuildItem` を使ってそれを実現しようとしています。

source: Sometimes it might be useful to register an existing annotation that is not annotated with `@javax.inject.Qualifier` as a CDI qualifier. This is similar to what CDI achieves through `BeforeBeanDiscovery#addQualifier()`. We are going to use `QualifierRegistrarBuildItem` to get it done.
ja_jp: 時には、 `@javax.inject.Qualifier` でアノテーションされていない既存のアノテーションをCDI修飾子として登録しておくと便利かもしれません。これは CDI が `BeforeBeanDiscovery#addQualifier()` を通して実現していることに似ています。ここでは `QualifierRegistrarBuildItem` を使ってそれを実現しようとしています。

source: Sometimes it might be useful to register your own named policy. You can get it done by creating application scoped CDI bean that implements the `io.quarkus.vertx.http.runtime.security.HttpSecurityPolicy` interface like in the example below:
ja_jp: 独自の名前付きポリシーを登録すると便利な場合があります。以下の例のように、 `io.quarkus.vertx.http.runtime.security.HttpSecurityPolicy` インターフェイスを実装するアプリケーションスコープの CDI Bean を作成することでこれを実現できます。

source: Sometimes it's desirable to either provide additional resources (e.g. a ConfigMap, a Secret, a Deployment for a database etc) or provide custom ones that will be used as a `base` for the generation process. Those resources can be added under `src/main/kubernetes` directory and can be named after the target environment (e.g. kubernetes.json, openshift.json, knative.json, or the yml equivalents). The correlation between provided and generated files is done by file name. So, a `kubernetes.json`/`kubernetes.yml` file added in `src/main/kubernetes` will only affect the generated `kubernetes.json`/`kubernetes.yml`. An `openshift.json`/`openshift.yml` file added in `src/main/kubernetes` will only affect the generated `openshift.json`/`openshift.yml`. A `knative.json`/`knative.yml` file added in `src/main/kubernetes` will only affect the generated `knative.json`/`knative.yml` and so on. The provided file may be either in json or yaml format and may contain one or more resources. These resources will end up in both generated formats (json and yaml). For example, a secret added in `src/main/kubernetes/kubernetes.yml` will be added to both the generated `kubernetes.yml` and `kubernetes.json`.
ja_jp: 追加リソース(ConfigMap、Secret、Deployment for a databaseなど)を提供するか、生成プロセスの `base` として使用されるカスタムリソースを提供することが望ましい場合があります。 これらのリソースは、 `src/main/kubernetes` ディレクトリの下に追加することができ、ターゲット環境にちなんだ名前にすることができます（kubernetes.json、openshift.json、knative.json、または同等のymlなど）。提供されたファイルと生成されたファイルの相関はファイル名で行われます。 つまり、 `src/main/kubernetes` に追加された `kubernetes.json` / `kubernetes.yml` ファイルは、生成された `kubernetes.json` / `kubernetes.yml` にのみ影響します。 `src/main/kubernetes` に追加された `openshift.json` / `openshift.yml` ファイルは、生成された `openshift.json` / `openshift.yml` にのみ影響します。 `src/main/kubernetes` に追加された `knative.json` / `knative.yml` ファイルは、生成された `knative.json` / `knative.yml` にのみ影響します。 提供されるファイルは json または yaml フォーマットで、1 つ以上のリソースを含むことができます。これらのリソースは、生成された両方のフォーマット (json と yaml) に含まれることになります。たとえば、 `src/main/kubernetes/kubernetes.yml` で追加されたシークレットは、生成された `kubernetes.yml` と `kubernetes.json` の両方に追加されます。

source: Sometimes it's desirable to either provide additional resources (e.g. a ConfigMap, a Secret, a Deployment for a database) or provide custom ones that will be used as a `base` for the generation process. Those resources can be added under `src/main/kubernetes` directory and can be named after the target environment (e.g. kubernetes.json, openshift.json, knative.json, or the yml equivalents). The correlation between provided and generated files is done by file name. So, a `kubernetes.json`/`kubernetes.yml` file added in `src/main/kubernetes` will only affect the generated `kubernetes.json`/`kubernetes.yml`. An `openshift.json`/`openshift.yml` file added in `src/main/kubernetes` will only affect the generated `openshift.json`/`openshift.yml`. A `knative.json`/`knative.yml` file added in `src/main/kubernetes` will only affect the generated `knative.json`/`knative.yml` and so on. The provided file may be either in json or yaml format and may contain one or more resources. These resources will end up in both generated formats (json and yaml). For example, a secret added in `src/main/kubernetes/kubernetes.yml` will be added to both the generated `kubernetes.yml` and `kubernetes.json`.
ja_jp: 追加のリソース (ConfigMap、Secret、データベースの Deployment など) を提供するか、生成プロセスのベースとして使用されるカスタムリソースを提供することが望ましい場合があります。これらのリソースは `src/main/kubernetes` ディレクトリーの下に追加でき、ターゲット環境にちなんだ名前を付けることができます (例: kubernetes.json、openshift.json、knative.json、または同等の yml)。提供されたファイルと生成されたファイルの関連付けは、ファイル名によって行われます。したがって、`src/main/kubernetes` に追加された `kubernetes.json`/`kubernetes.yml` ファイルは、生成された `kubernetes.json`/`kubernetes.yml` にのみ影響します。`src/main/kubernetes` に追加された `openshift.json`/`openshift.yml` ファイルは、生成された `openshift.json`/`openshift.yml` にのみ影響します。`src/main/kubernetes` に追加された `knative.json`/`knative.yml` ファイルは、生成された `knative.json`/`knative.yml` などにのみ影響します。提供されるファイルは、json または yaml 形式のいずれかで、1 つ以上のリソースが含まれる場合があります。これらのリソースは、生成された両方の形式 (json と yaml) になります。たとえば、`src/main/kubernetes/kubernetes.yml` に追加されたシークレットは、生成された `kubernetes.yml` と `kubernetes.json` の両方に追加されます。

source: Sometimes it's easier to see what needs to be done in a diff.
ja_jp: 差分を見ると、何をすべきかがわかりやすい場合があります。

source: Sometimes it's necessary to execute an asynchronous code from a blocking thread. Specifically, to execute the code on a Vert.x thread with an isolated/duplicated Vert.x context. A typical example is an asynchronous code that needs to leverage the Hibernate Reactive API during application startup. Quarkus provides the `VertxContextSupport#subscribeAndAwait()` method which subscribes to the supplied `io.smallrye.mutiny.Uni` on a Vert.x duplicated context, then blocks the current thread and waits for the result.
ja_jp: ブロッキングスレッドから非同期コードを実行する必要がある場合があります。 具体的には、分離/複製されたVert.xコンテキストを持つVert.xスレッドでコードを実行します。 典型的な例は、アプリケーションの起動時にHibernate Reactive APIを活用する必要がある非同期コードです。 Quarkusは、 `VertxContextSupport#subscribeAndAwait()` メソッドを提供します。このメソッドは、Vert.xの複製されたコンテキスト上で提供された `io.smallrye.mutiny.Uni` を購読し、現在のスレッドをブロックして結果を待ちます。

source: Sometimes it's practical to cache parts of the template that rarely change. In order to use the caching capability, register and configure the built-in `io.quarkus.qute.CacheSectionHelper.Factory`:
ja_jp: めったに変更されないテンプレートの一部をキャッシュすることが実用的な場合もあります。キャッシュ機能を使うには、組み込みの `io.quarkus.qute.CacheSectionHelper.Factory` を登録・設定します:

source: Sometimes it's useful to create a customized SSE message, for example if you need to specify the `event` field of a SSE message to distinguish various event types. A resource method may return `Multi<jakarta.ws.rs.sse.OutboundSseEvent>` and an injected `jakarta.ws.rs.sse.Sse` can be used to create `OutboundSseEvent` instances.
ja_jp: さまざまなイベントタイプを区別するために SSE メッセージの `event` フィールドを指定する必要がある場合など、カスタマイズされた SSE メッセージを作成すると便利な場合があります。 リソースメソッドは `Multi<jakarta.ws.rs.sse.OutboundSseEvent>` を返します。また、挿入された `jakarta.ws.rs.sse.Sse` を使用して `OutboundSseEvent` インスタンスを作成できます。

source: Sometimes it's useful to render a specific variant of the template based on the content negotiation. This can be done by setting a special attribute via `TemplateInstance.setAttribute()`:
ja_jp: コンテンツネゴシエーションに基づいてテンプレートの特定のバリアントをレンダリングすることが有用な場合があります。これは `TemplateInstance.setAttribute()` を通じて特別な属性を設定することで行うことができます。

source: Sometimes it's useful to render a specific variant of the template based on the content negotiation. This can be done by setting a special attribute via `TemplateInstance.setVariant()`:
ja_jp: 場合によっては、コンテンツネゴシエーションに基づき、テンプレートの特定バリアントをレンダリングすると便利です。 これは `TemplateInstance.setVariant()` を使用して特別な属性を設定することで実行できます。

source: Sometimes one wants to cache the result of an (expensive) remote call. If the remote call fails, one may not want to cache the result or exception, but rather re-try the remote call on the next invocation.
ja_jp: (高価な)リモートコールの結果をキャッシュしたい場合があります。リモートコールが失敗した場合、結果や例外をキャッシュするのではなく、 次の呼び出しでリモートコールを再試行したい場合があります。

source: Sometimes the roles are contained in the UserInfo response - do `quarkus.oidc.roles.source=userinfo` in this case.
ja_jp: ロールが UserInfo レスポンスに含まれている場合もあります。その場合は `quarkus.oidc.roles.source=userinfo` を設定してください。

source: Sometimes when testing you only need to verify that a certain logical path was taken, or you only need to stub out a single method's response while still executing the rest of the methods on the Spied clone. Please see link:https://javadoc.io/doc/org.mockito/mockito-core/latest/org/mockito/Mockito.html#13[Mockito documentation - Spying on real objects] for more details on Spy partial mocks. In either of those situations a Spy of the object is preferable. Using `@InjectSpy`, the previous example could be written as follows:
ja_jp: テストの際に、特定の論理パスが通ったことを確認するだけでよい場合や、Spyされたクローン上の残りのメソッドを実行したまま、単一のメソッドのレスポンスをスタブアウトするだけでよい場合があります。Spy部分モックの詳細については、 link:https://javadoc.io/doc/org.mockito/mockito-core/latest/org/mockito/Mockito.html#13[Mockitoドキュメント - Spying on real objects] を参照してください。いずれの場合も、オブジェクトのSpyを使用することが望ましいです。 `@InjectSpy` を使うと、先ほどの例は次のように書くことができます:

source: Sometimes when testing you only need to verify that a certain logical path was taken, or you only need to stub out a single method's response while still executing the rest of the methods on the Spied clone. Please see link:https://javadoc.io/doc/org.mockito/mockito-core/latest/org/mockito/Mockito.html#spy-T-[Mockito documentation] for more details on Spy partial mocks. In either of those situations a Spy of the object is preferable. Using `@InjectSpy`, the previous example could be written as follows:
ja_jp: テストを行う際に、特定の論理パスが取られたかどうかを確認するだけで済む場合もありますし、Spied クローン上で残りのメソッドを実行している間に、1つのメソッドのレスポンスをスタブアウトするだけで済む場合もあります。Spy パーシャル モックの詳細については link:https://javadoc.io/doc/org.mockito/mockito-core/latest/org/mockito/Mockito.html#spy-T-[Mockito のドキュメント]を参照してください。いずれの場合も、オブジェクトの Spy が望ましいでしょう。 `@InjectSpy` を使用して、先ほどの例は次のように書くことができます。

source: Sometimes you may want to reload the whole Maven process in order to pick up changes in the `pom.xml` file or to add/remove extensions. Quarkus automatically detects changes in the `pom.xml` file and restarts the Maven process if needed.
ja_jp: `pom.xml` ファイルの変更を反映したり、エクステンションを追加または削除したりするために、Maven プロセス全体をリロードしたい場合があります。Quarkus は `pom.xml` ファイルの変更を自動的に検出し、必要に応じて Maven プロセスを再起動します。

source: Sometimes you might need to perform one or more actions only after successful completion of the authorization code flow.
ja_jp: 認可コードフローが正常に完了したときにのみ、1 つ以上のアクションを実行する必要がある場合があります。

source: Sometimes you need more than just handling messages one by one. You can also express your message processing logic using reactive programming as illustrated in the following snippet:
ja_jp: メッセージを1つ1つ処理するだけでは不十分な場合があります。次の例のように、メッセージ処理ロジックをリアクティブ・プログラミングで表現することもできます。

source: Sometimes you need the full control over the bean attributes and maybe even configure the default mock behavior. You can use the mock configurator API via the `QuarkusComponentTestExtensionBuilder#mock()` method.
ja_jp: 場合によっては、Bean 属性を完全に制御し、デフォルトのモック動作を設定する必要があることもあります。 `QuarkusComponentTestExtensionBuilder#mock()` メソッドを介して、モックコンフィギュレーター API を使用できます。

source: Sometimes you need to run xref:dev-ui.adoc#jsonrpc-against-the-deployment-classpath[actions on the deployment classpath] (for example, writing configuration files). In that case you do not create a JSON‑RPC service; instead you provide a supplier via a `BuildTimeActionBuildItem`:
ja_jp: デプロイメントクラスパス上で xref:dev-ui.adoc#jsonrpc-against-the-deployment-classpath[アクションを実行] する必要がある場合があります (設定ファイルの書き込みなど)。その場合、JSON‑RPC サービスは作成せず、代わりに `BuildTimeActionBuildItem` を介してサプライヤーを提供します。

source: Sometimes you need to share the server between applications. Dev Services for Elasticsearch implements a _service discovery_ mechanism for your multiple Quarkus applications running in _dev_ mode to share a single server.
ja_jp: アプリケーション間でサーバーを共有する必要がある場合があります。Dev Services for Elasticsearchは、 _開発_ モードで実行されている複数のQuarkusアプリケーションが1つのサーバーを共有できるように、 _サービス検出_ メカニズムを実装しています。

source: Sometimes you need to use the configuration to work around the fact that some providers do not implement OpenID Connect completely or when they are in fact xref:security-oidc-code-flow-authentication.adoc#oauth2[OAuth2 providers only].
ja_jp: プロバイダによってはOpenID Connectを完全に実装していなかったり、実際には xref:security-oidc-code-flow-authentication.adoc#oauth2[OAuth2プロバイダのみ] であったりするため、設定を使用して回避する必要がある場合があります。

source: Sometimes you need to use the configuration to work around the fact that some providers do not implement OpenID Connect completely or when they are in fact xref:security-openid-connect-web-authentication.adoc#oauth2[OAuth2 providers only].
ja_jp: 一部のプロバイダーは OpenID Connect を完全に実装していなかったり、実際は xref:security-openid-connect-web-authentication.adoc#oauth2[OAuth2 providers only] だったりするため、これらを回避するために設定を使用しなければならない場合があります。

source: Sometimes you only need build-time information to be passed to your template, so you can do it like this:
ja_jp: ビルドタイムの情報だけをテンプレートに渡す必要がある場合もあります。その場合、このようにすることができます:
